performance.yml
execution:
  - concurrency: 60
    hold-for: 1m
    ramp-up: 10s
    scenario: simple-web-server

scenarios:
  simple-web-server:
    retrieve-resources: false
    requests:
      - http://127.0.0.1:8080
      - http://127.0.0.1:8080/readme.md
      - http://127.0.0.1:8080/src/main/java/liteweb/Server.java
      - http://127.0.0.1:8080/readme.md
      - http://127.0.0.1:8080/performance.yml

reporting:
  - module: final-stats
  - module: console

settings:
  check-interval: 5s
  default-executor: jmeter

provisioning: local